wrk+async/put-alloc.log
$ ./wrk2/wrk -t4 -c4 -d120s -R10000 -s put.lua --latency http://localhost:8080
Running 2m test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 1.022ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.032ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.023ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.022ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.08ms    1.70ms 112.64ms   99.72%
    Req/Sec     2.63k   250.56    11.67k    80.99%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.02ms
 75.000%    1.42ms
 90.000%    1.74ms
 99.000%    1.94ms
 99.900%   17.81ms
 99.990%   79.23ms
 99.999%  109.44ms
100.000%  112.70ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.068     0.000000            1         1.00
       0.309     0.100000       110246         1.11
       0.525     0.200000       220110         1.25
       0.741     0.300000       330233         1.43
       0.913     0.400000       440400         1.67
       1.023     0.500000       550000         2.00
       1.077     0.550000       605740         2.22
       1.131     0.600000       660506         2.50
       1.203     0.650000       715186         2.86
       1.309     0.700000       770389         3.33
       1.417     0.750000       825194         4.00
       1.472     0.775000       852602         4.44
       1.527     0.800000       880364         5.00
       1.579     0.825000       907627         5.71
       1.633     0.850000       935145         6.67
       1.686     0.875000       962891         8.00
       1.713     0.887500       976370         8.89
       1.741     0.900000       990045        10.00
       1.769     0.912500      1003904        11.43
       1.797     0.925000      1017548        13.33
       1.825     0.937500      1031601        16.00
       1.838     0.943750      1038318        17.78
       1.851     0.950000      1045348        20.00
       1.864     0.956250      1051995        22.86
       1.877     0.962500      1059171        26.67
       1.890     0.968750      1066021        32.00
       1.896     0.971875      1069042        35.56
       1.903     0.975000      1072565        40.00
       1.910     0.978125      1076137        45.71
       1.917     0.981250      1079557        53.33
       1.924     0.984375      1082916        64.00
       1.928     0.985938      1084613        71.11
       1.933     0.987500      1086390        80.00
       1.938     0.989062      1087910        91.43
       1.946     0.990625      1089782       106.67
       1.955     0.992188      1091344       128.00
       1.962     0.992969      1092254       142.22
       1.971     0.993750      1093092       160.00
       1.985     0.994531      1093961       182.86
       2.007     0.995313      1094788       213.33
       2.077     0.996094      1095644       256.00
       2.233     0.996484      1096074       284.44
       2.449     0.996875      1096496       320.00
       2.887     0.997266      1096926       365.71
       3.625     0.997656      1097356       426.67
       4.763     0.998047      1097786       512.00
       5.619     0.998242      1098000       568.89
       7.595     0.998437      1098215       640.00
      10.527     0.998633      1098430       731.43
      13.975     0.998828      1098645       853.33
      18.415     0.999023      1098860      1024.00
      21.327     0.999121      1098967      1137.78
      25.151     0.999219      1099074      1280.00
      29.503     0.999316      1099182      1462.86
      33.887     0.999414      1099289      1706.67
      38.431     0.999512      1099396      2048.00
      42.079     0.999561      1099450      2275.56
      46.303     0.999609      1099505      2560.00
      51.711     0.999658      1099558      2925.71
      57.023     0.999707      1099611      3413.33
      62.303     0.999756      1099665      4096.00
      64.991     0.999780      1099692      4551.11
      67.647     0.999805      1099719      5120.00
      70.079     0.999829      1099746      5851.43
      72.575     0.999854      1099773      6826.67
      75.263     0.999878      1099800      8192.00
      76.479     0.999890      1099813      9102.22
      80.191     0.999902      1099826     10240.00
      84.415     0.999915      1099840     11702.86
      88.447     0.999927      1099853     13653.33
      92.351     0.999939      1099866     16384.00
      94.527     0.999945      1099873     18204.44
      96.639     0.999951      1099880     20480.00
      98.815     0.999957      1099887     23405.71
     100.607     0.999963      1099893     27306.67
     102.783     0.999969      1099900     32768.00
     103.679     0.999973      1099903     36408.89
     104.895     0.999976      1099907     40960.00
     105.791     0.999979      1099910     46811.43
     106.687     0.999982      1099913     54613.33
     107.903     0.999985      1099917     65536.00
     108.223     0.999986      1099918     72817.78
     108.799     0.999988      1099920     81920.00
     109.439     0.999989      1099922     93622.86
     109.695     0.999991      1099923    109226.67
     110.335     0.999992      1099925    131072.00
     110.655     0.999993      1099926    145635.56
     110.911     0.999994      1099927    163840.00
     111.231     0.999995      1099928    187245.71
     111.231     0.999995      1099928    218453.33
     111.551     0.999996      1099929    262144.00
     111.807     0.999997      1099930    291271.11
     111.807     0.999997      1099930    327680.00
     112.127     0.999997      1099931    374491.43
     112.127     0.999998      1099931    436906.67
     112.127     0.999998      1099931    524288.00
     112.447     0.999998      1099932    582542.22
     112.447     0.999998      1099932    655360.00
     112.447     0.999999      1099932    748982.86
     112.447     0.999999      1099932    873813.33
     112.447     0.999999      1099932   1048576.00
     112.703     0.999999      1099933   1165084.44
     112.703     1.000000      1099933          inf
#[Mean    =        1.077, StdDeviation   =        1.701]
#[Max     =      112.640, Total count    =      1099933]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1199973 requests in 2.00m, 76.67MB read
Requests/sec:   9999.91
Transfer/sec:    654.29KB